In [1]:
import pandas as pd

In [2]:
crop_array = {
    'MAIZE':1,
    'MILLET':2,
    'LOCAL RICE':3,
    'SORGHUM':4,
    'YAM':5,
    'COCOYAM':6
}

In [3]:
month_array = {
    'JANUARY':1,
    'FEBRUARY':2,
    'MARCH':3,
    'APRIL':4,
    'MAY':5,
    'JUNE':6,
    'JULY':7,
    'AUGUST':8,
    'SEPTEMBER':9,
    'OCTOBER':10,
    'NOVEMBER':11,
    'DECEMBER':12,
    'Jan':1,
    'Feb':2,
    'Mar':3,
    'Apr':4,
    'May':5,
    'Jun':6,
    'Jul':7,
    'Aug':8,
    'Sep':9,
    'Oct':10,
    'Nov':11,
    'Dec':12
}

In [4]:
complete_dataset = pd.read_csv("COMPLETE_DATASET.csv")

In [5]:
complete_dataset.head()

  Commodity  Year    Month   Price
0   COCOYAM  1970  JANUARY  0.0005
1   COCOYAM  1971  JANUARY  0.0007
2   COCOYAM  1972  JANUARY  0.0008
3   COCOYAM  1973  JANUARY   0.001
4   COCOYAM  1974  JANUARY  0.0011

In [6]:
complete_dataset['Month'] = complete_dataset.Month.map(month_array)

In [7]:
complete_dataset.head()

  Commodity  Year  Month   Price
0   COCOYAM  1970      1  0.0005
1   COCOYAM  1971      1  0.0007
2   COCOYAM  1972      1  0.0008
3   COCOYAM  1973      1   0.001
4   COCOYAM  1974      1  0.0011

In [8]:
complete_dataset['Commodity'] = complete_dataset.Commodity.map(crop_array)
complete_dataset.head()

   Commodity  Year  Month   Price
0          6  1970      1  0.0005
1          6  1971      1  0.0007
2          6  1972      1  0.0008
3          6  1973      1   0.001
4          6  1974      1  0.0011

In [9]:
complete_dataset.to_csv("super_dataframe.csv")

In [11]:
test = pd.read_csv('super_dataframe.csv')